# Movie Database with SQL 
Author: Kim Hazed Delfino

## Imports

In [1]:
import pandas as pd
import numpy as np

## Load Dataset

In [2]:
# Load files
basics_url = "https://datasets.imdbws.com/title.basics.tsv.gz"
ratings_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"
akas_url = "https://datasets.imdbws.com/title.akas.tsv.gz"

basics = pd.read_csv(basics_url, sep='\t', low_memory=False)
ratings = pd.read_csv(ratings_url, sep='\t', low_memory=False)
akas = pd.read_csv(akas_url, sep='\t', low_memory=False)

### Preprossing - Title Basics

In [3]:
# Drop missing values from runtimeMinutes and genre
runtime_filter = basics['runtimeMinutes'] != '\\N'

genre_filter = basics['genres'] != '\\N'

In [4]:
# Create new filtered df 
basics_rtime_genre_filtered = basics[runtime_filter & genre_filter]

In [5]:
# Filter titleType and startYear
type_filter = basics_rtime_genre_filtered['titleType'] == 'movie'

years_filter = basics_rtime_genre_filtered['startYear'] != '\\N'

In [6]:
# Create filtered df 
basics_df = basics_rtime_genre_filtered[type_filter & years_filter]

In [7]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 377671 entries, 8 to 9949410
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          377671 non-null  object
 1   titleType       377671 non-null  object
 2   primaryTitle    377671 non-null  object
 3   originalTitle   377671 non-null  object
 4   isAdult         377671 non-null  object
 5   startYear       377671 non-null  object
 6   endYear         377671 non-null  object
 7   runtimeMinutes  377671 non-null  object
 8   genres          377671 non-null  object
dtypes: object(9)
memory usage: 28.8+ MB

In [8]:
# Convert startYear value into int dtype
basics_df['startYear'] = basics_df['startYear'].astype(int)

/var/folders/wc/9tkd0z553zj73cz8shkwx5k40000gn/T/ipykernel_1750/2533919934.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  basics_df['startYear'] = basics_df['startYear'].astype(int)

In [9]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 377671 entries, 8 to 9949410
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          377671 non-null  object
 1   titleType       377671 non-null  object
 2   primaryTitle    377671 non-null  object
 3   originalTitle   377671 non-null  object
 4   isAdult         377671 non-null  object
 5   startYear       377671 non-null  int64
 6   endYear         377671 non-null  object
 7   runtimeMinutes  377671 non-null  object
 8   genres          377671 non-null  object
dtypes: int64(1), object(8)
memory usage: 28.8+ MB

In [10]:
max(basics_df['startYear'])

2029

In [11]:
# Filter movies with only startYear 2000 to 2022
year_filter_2000 = basics_df['startYear'] >= 2000
year_filter_2021 = basics_df['startYear'] < 2022
basics_20_to_21 = basics_df[year_filter_2000 & year_filter_2021]

In [12]:
basics_20_to_21.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 210867 entries, 13082 to 9949410
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          210867 non-null  object
 1   titleType       210867 non-null  object
 2   primaryTitle    210867 non-null  object
 3   originalTitle   210867 non-null  object
 4   isAdult         210867 non-null  object
 5   startYear       210867 non-null  int64
 6   endYear         210867 non-null  object
 7   runtimeMinutes  210867 non-null  object
 8   genres          210867 non-null  object
dtypes: int64(1), object(8)
memory usage: 16.1+ MB

In [13]:
# Replace '\N' values with np.nan
basics_20_to_21.replace({'\\N':np.nan},inplace=True)

/var/folders/wc/9tkd0z553zj73cz8shkwx5k40000gn/T/ipykernel_1750/3930796260.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  basics_20_to_21.replace({'\\N':np.nan},inplace=True)

In [14]:
# Check df
basics_20_to_21.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 210867 entries, 13082 to 9949410
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          210867 non-null  object
 1   titleType       210867 non-null  object
 2   primaryTitle    210867 non-null  object
 3   originalTitle   210867 non-null  object
 4   isAdult         210867 non-null  object
 5   startYear       210867 non-null  int64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  210867 non-null  object
 8   genres          210867 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 16.1+ MB

In [15]:
basics_20_to_21.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
13082,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0,2021,NaN,94,Documentary
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
42384,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
61115,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
67667,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama

In [16]:
# Filter out Documentary in our df
is_documentary = basics_20_to_21['genres'].str.contains('documentary',case=False)
basics_20_21_filtered = basics_20_to_21[~is_documentary]

In [17]:
basics_20_21_filtered.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 138660 entries, 34803 to 9949310
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          138660 non-null  object
 1   titleType       138660 non-null  object
 2   primaryTitle    138660 non-null  object
 3   originalTitle   138660 non-null  object
 4   isAdult         138660 non-null  object
 5   startYear       138660 non-null  int64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  138660 non-null  object
 8   genres          138660 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 10.6+ MB

### Preprocessing - AKAs

In [18]:
# Check df 
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36323997 entries, 0 to 36323996
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.2+ GB

In [19]:
# Keep only US region
us_akas = akas[akas['region']== 'US']

In [20]:
# Replace '\\N' with np.nan
us_akas.replace({'\\N':np.nan},inplace=True)

/var/folders/wc/9tkd0z553zj73cz8shkwx5k40000gn/T/ipykernel_1750/4291115757.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  us_akas.replace({'\\N':np.nan},inplace=True)

In [21]:
# Double check
us_akas.sample(5)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
21675661,tt2237994,1,Jennifer at Papa John's,US,NaN,imdbDisplay,NaN,0
19115469,tt1961599,1,The Substitute Waiter,US,NaN,imdbDisplay,NaN,0
17535142,tt1748173,2,Public Restroom,US,NaN,imdbDisplay,NaN,0
30094172,tt6099422,1,Mind the Gap,US,NaN,NaN,NaN,0
18119102,tt18309494,1,2 Richards! The African Company,US,NaN,NaN,NaN,0

In [22]:
# Filter only US using AKAs dataset 
us_filter = basics_20_21_filtered['tconst'].isin(us_akas['titleId'])

In [23]:
# Create filtered df
us_basics_df = basics_20_21_filtered[us_filter]

In [24]:
# Doublec check df 
us_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81775 entries, 34803 to 9949226
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81775 non-null  object
 1   titleType       81775 non-null  object
 2   primaryTitle    81775 non-null  object
 3   originalTitle   81775 non-null  object
 4   isAdult         81775 non-null  object
 5   startYear       81775 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81775 non-null  object
 8   genres          81775 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 6.2+ MB

In [25]:
us_basics_df.sample(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
232913,tt0243133,movie,The Man Who Wasn't There,The Man Who Wasn't There,0,2001,NaN,116,"Crime,Drama"
3636512,tt1488065,movie,Roulette City,Roulette City,0,2012,NaN,76,"Drama,Thriller"
7480064,tt4450000,movie,The Second Coming: Brought to You in Low Defin...,The Second Coming: Brought to You in Low Defin...,0,2014,NaN,74,"Comedy,Romance"
1834945,tt1156136,movie,Linger,Hu die fei,0,2008,NaN,88,"Drama,Romance"
7502845,tt4501740,movie,Nation's Fire,Nation's Fire,0,2019,NaN,86,"Action,Thriller"

### Preprocessing - Ratings

In [26]:
# Check df
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1322519 entries, 0 to 1322518
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1322519 non-null  object
 1   averageRating  1322519 non-null  float64
 2   numVotes       1322519 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.3+ MB

In [27]:
ratings.sample(5)

             tconst  averageRating  numVotes
1268823   tt8435002            4.1      8291
698045   tt15028676            6.0       161
160092    tt0262670            7.2        37
64547     tt0089823            4.8       328
1049879   tt4289280            5.2        25

In [28]:
# Filter only US region
us_rating_filter =  ratings['tconst'].isin(us_akas['titleId'])

In [29]:
# Create filtered df 
us_ratings_df = ratings[us_rating_filter]

# Replace '\\N' with np.nan
us_ratings_df.replace({'\\N':np.nan},inplace=True)

/var/folders/wc/9tkd0z553zj73cz8shkwx5k40000gn/T/ipykernel_1750/2744651486.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  us_ratings_df.replace({'\\N':np.nan},inplace=True)

In [30]:
# Double check df
us_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 501745 entries, 0 to 1322494
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         501745 non-null  object
 1   averageRating  501745 non-null  float64
 2   numVotes       501745 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.3+ MB

In [31]:
us_ratings_df.sample(5)

            tconst  averageRating  numVotes
52214    tt0075510            5.9       114
143063   tt0225344            5.6        17
805021  tt18830896            6.3      1500
723934   tt1562480            3.5        10
967565   tt3025894            4.9       136

In [32]:
# example making new folder with os
import os
os.makedirs('Data/',exist_ok=True) 
# Confirm folder created
os.listdir("Data/")

['final_tmdb_data_2006.csv.gz',
 'tmdb_api_results_2006.json',
 'final_tmdb_data_2008.csv.gz',
 'final_tmdb_data_2004.csv.gz',
 'tmdb_api_results_2007.json',
 'tmdb_api_results_2000.json',
 'final_tmdb_data_2000.csv.gz',
 'tmdb_api_results_2001.json',
 'final_tmdb_data_2002.csv.gz',
 'title_basics.csv.gz',
 'Movies.sql',
 'tmdb_api_results_2002.json',
 'final_tmdb_data_2007.csv.gz',
 'tmdb_api_results_2003.json',
 'final_tmdb_data_2005.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'tmdb_api_results_2004.json',
 'tmdb_api_results_2008.json',
 'title_akas.csv.gz',
 'final_tmdb_data_2003.csv.gz',
 'tmdb_api_results_2005.json',
 'title_ratings.csv.gz']

In [33]:
## Save dataframe to file.
us_basics_df.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

us_ratings_df.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

us_akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

# API Calls

## Imports

In [34]:
import os, time, json
import tmdbsimple as tmdb
from tqdm import tqdm_notebook
import warnings
warnings.filterwarnings('ignore')
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['final_tmdb_data_2006.csv.gz',
 'tmdb_api_results_2006.json',
 'final_tmdb_data_2008.csv.gz',
 'final_tmdb_data_2004.csv.gz',
 'tmdb_api_results_2007.json',
 'tmdb_api_results_2000.json',
 'final_tmdb_data_2000.csv.gz',
 'tmdb_api_results_2001.json',
 'final_tmdb_data_2002.csv.gz',
 'title_basics.csv.gz',
 'Movies.sql',
 'tmdb_api_results_2002.json',
 'final_tmdb_data_2007.csv.gz',
 'tmdb_api_results_2003.json',
 'final_tmdb_data_2005.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'tmdb_api_results_2004.json',
 'tmdb_api_results_2008.json',
 'title_akas.csv.gz',
 'final_tmdb_data_2003.csv.gz',
 'tmdb_api_results_2005.json',
 'title_ratings.csv.gz']

## Credentials

In [35]:
with open("/Users/kim/.secret/tmdb_api.json", "r") as f:
    login = json.load(f)

# Display loaded dict 
login.keys()

dict_keys(['client-id', 'api-key'])

In [36]:
# Set API Key 
tmdb.API_KEY = login['client-id'] # api key stored as client-id and api_token as api-key

## Custom Function

In [37]:
def write_json(new_data, filename):     
    with open(filename,'r+') as file:
        # First we load existing data into a dict.
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
             file_data.append(new_data)
        # Sets file's current position at offset.
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)

In [38]:
def get_movie_with_rating(movie_id):
    # Get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    # Save the .info .realeases dict
    info = movie.info()

    release = movie.releases()
    # Loop through countries in releases
    for c in release['countries']:
        # Store if c == US 
        if c['iso_3166_1'] == 'US':
            info['certification'] = c['certification']

    return info

In [39]:
# Testing custom func
avenger_info = get_movie_with_rating("tt0848228")
avenger_info

{'adult': False,
 'backdrop_path': '/9BBTo63ANSmhC4e6r62OJFuK2GL.jpg',
 'belongs_to_collection': {'id': 86311,
  'name': 'The Avengers Collection',
  'poster_path': '/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg',
  'backdrop_path': '/zuW6fOiusv4X9nnW3paHGfXcSll.jpg'},
 'budget': 220000000,
 'genres': [{'id': 878, 'name': 'Science Fiction'},
  {'id': 28, 'name': 'Action'},
  {'id': 12, 'name': 'Adventure'}],
 'homepage': 'https://www.marvel.com/movies/the-avengers',
 'id': 24428,
 'imdb_id': 'tt0848228',
 'original_language': 'en',
 'original_title': 'The Avengers',
 'overview': 'When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!',
 'popularity': 121.802,
 'poster_path': '/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg',
 'production_companies': [{'id': 420,
   'logo_path': '/hUzeosd33nzE5MCNsZxCGEKTXaQ.png',
   'name': 'Marvel Studios',
   'origin_country': 'US'}],
 'production_countries': [{'iso_3166_1': 'US',
   'name': 'United States of America'}],
 'release_date': '2012-04-25',
 'revenue': 1518815515,
 'runtime': 143,
 'spoken_languages': [{'english_name': 'English',
   'iso_639_1': 'en',
   'name': 'English'},
  {'english_name': 'Hindi', 'iso_639_1': 'hi', 'name': 'हिन्दी'},
  {'english_name': 'Russian', 'iso_639_1': 'ru', 'name': 'Pусский'}],
 'status': 'Released',
 'tagline': 'Some assembly required.',
 'title': 'The Avengers',
 'video': False,
 'vote_average': 7.708,
 'vote_count': 28744,
 'certification': 'PG-13'}

In [40]:
the_notebook_info = get_movie_with_rating("tt0332280")
the_notebook_info

{'adult': False,
 'backdrop_path': '/qom1SZSENdmHFNZBXbtJAU0WTlC.jpg',
 'belongs_to_collection': None,
 'budget': 29000000,
 'genres': [{'id': 10749, 'name': 'Romance'}, {'id': 18, 'name': 'Drama'}],
 'homepage': 'http://www.newline.com/properties/notebookthe.html',
 'id': 11036,
 'imdb_id': 'tt0332280',
 'original_language': 'en',
 'original_title': 'The Notebook',
 'overview': "An epic love story centered around an older man who reads aloud to a woman with Alzheimer's. From a faded notebook, the old man's words bring to life the story about a couple who is separated by World War II, and is then passionately reunited, seven years later, after they have taken different paths.",
 'popularity': 57.441,
 'poster_path': '/rNzQyW4f8B8cQeg7Dgj3n6eT5k9.jpg',
 'production_companies': [{'id': 12,
   'logo_path': '/5ThIuO93vsk47oexKTSdfKEr7EC.png',
   'name': 'New Line Cinema',
   'origin_country': 'US'},
  {'id': 1565, 'logo_path': None, 'name': 'Avery Pix', 'origin_country': 'US'},
  {'id': 2605,
   'logo_path': None,
   'name': 'Gran Via Productions',
   'origin_country': 'US'}],
 'production_countries': [{'iso_3166_1': 'US',
   'name': 'United States of America'}],
 'release_date': '2004-06-25',
 'revenue': 115603229,
 'runtime': 123,
 'spoken_languages': [{'english_name': 'English',
   'iso_639_1': 'en',
   'name': 'English'}],
 'status': 'Released',
 'tagline': 'Behind every great love is a great story.',
 'title': 'The Notebook',
 'video': False,
 'vote_average': 7.879,
 'vote_count': 10382,
 'certification': 'PG-13'}

In [41]:
# Load basics csv
basics_df = pd.read_csv("/Users/kim/Documents/GitHub/repo/Movie_database/Data/title_basics.csv.gz")

In [42]:
# Set target 
YEARS_TO_GET  = [2000,2001,2002,2003,2004,2005,2006,2007,2008]

In [43]:
# Capture errors
errors = []

In [44]:
# Loop through the data
for YEAR in tqdm_notebook(YEARS_TO_GET, desc='YEARS', position = 0):
    JSON_FILE = f"{FOLDER}tmdb_api_results_{YEAR}.json"
    is_file = os.path.isfile(JSON_FILE)
    if not is_file:
        with open(JSON_FILE,'w') as f:
            json.dump([{"imdb_id":0}],f)

        df = basics_df.loc[basics_df['startYear']== YEAR].copy()
        movie_ids = df['tconst'].copy()
        # load existing data
        previous_df = pd.read_json(JSON_FILE)

        movie_id_to_get = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]

        for movie_id in tqdm_notebook(movie_id_to_get,
                                      desc= f'Movies from {YEAR}',
                                      position =1,
                                      leave=True):
            try:
                # Store data for the movie id 
                temp = get_movie_with_rating(movie_id)
                write_json(temp,JSON_FILE)
                time.sleep(.02)
                
            except Exception as e:
                errors.append([movie_id,e])
        final_year_df = pd.read_json(JSON_FILE)
        final_year_df.to_csv(f"{FOLDER}final_tmdb_data_{YEAR}.csv.gz", compression='gzip',
                     index=False)

YEARS:   0%|          | 0/9 [00:00<?, ?it/s]

In [45]:
print(f" total errors: {len(errors)}")

 total errors: 0

In [46]:
# Read Csv file
tmdb_list = []
years = ['2000','2001','2002','2003','2004','2005','2006','2007','2008']
for year in years:
    path = "/Users/kim/Documents/GitHub/repo/Movie_database/Data/final_tmdb_data_"+year+".csv.gz"
    curr_year = pd.read_csv(path,sep=',',lineterminator='\n', low_memory=False)
    tmdb_list.append(curr_year)
    print(f"tmdb_{year} has been processed")

tmdb_2000 has been processed
tmdb_2001 has been processed
tmdb_2002 has been processed
tmdb_2003 has been processed
tmdb_2004 has been processed
tmdb_2005 has been processed
tmdb_2006 has been processed
tmdb_2007 has been processed
tmdb_2008 has been processed

In [47]:
# Combine all file into one DataFrame
combined_df = pd.concat(tmdb_list)
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14351 entries, 0 to 2167
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                14351 non-null  object
 1   adult                  14342 non-null  float64
 2   backdrop_path          7904 non-null   object
 3   belongs_to_collection  1122 non-null   object
 4   budget                 14342 non-null  float64
 5   genres                 14342 non-null  object
 6   homepage               2073 non-null   object
 7   id                     14342 non-null  float64
 8   original_language      14342 non-null  object
 9   original_title         14342 non-null  object
 10  overview               14006 non-null  object
 11  popularity             14342 non-null  float64
 12  poster_path            12662 non-null  object
 13  production_companies   14342 non-null  object
 14  production_countries   14342 non-null  object
 15  release_date           14107 non-null  object
 16  revenue                14342 non-null  float64
 17  runtime                14342 non-null  float64
 18  spoken_languages       14342 non-null  object
 19  status                 14342 non-null  object
 20  tagline                6140 non-null   object
 21  title                  14342 non-null  object
 22  video                  14342 non-null  float64
 23  vote_average           14342 non-null  float64
 24  vote_count             14342 non-null  float64
 25  certification          4608 non-null   object
dtypes: float64(9), object(17)
memory usage: 3.0+ MB

## Exploratory Data Analysis

In [48]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14351 entries, 0 to 2167
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                14351 non-null  object
 1   adult                  14342 non-null  float64
 2   backdrop_path          7904 non-null   object
 3   belongs_to_collection  1122 non-null   object
 4   budget                 14342 non-null  float64
 5   genres                 14342 non-null  object
 6   homepage               2073 non-null   object
 7   id                     14342 non-null  float64
 8   original_language      14342 non-null  object
 9   original_title         14342 non-null  object
 10  overview               14006 non-null  object
 11  popularity             14342 non-null  float64
 12  poster_path            12662 non-null  object
 13  production_companies   14342 non-null  object
 14  production_countries   14342 non-null  object
 15  release_date           14107 non-null  object
 16  revenue                14342 non-null  float64
 17  runtime                14342 non-null  float64
 18  spoken_languages       14342 non-null  object
 19  status                 14342 non-null  object
 20  tagline                6140 non-null   object
 21  title                  14342 non-null  object
 22  video                  14342 non-null  float64
 23  vote_average           14342 non-null  float64
 24  vote_count             14342 non-null  float64
 25  certification          4608 non-null   object
dtypes: float64(9), object(17)
memory usage: 3.0+ MB

In [49]:
combined_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2221.0,PG

### Questions to answer

- How many movies had at least some valid financial info? (budget OR revenue > 0)

In [50]:
# Create filter
has_budget = combined_df["budget"] > 0
has_revenue = combined_df["revenue"] > 0

In [51]:
# Filter with financial movies
with_financial_filtered = combined_df[has_budget | has_revenue]
with_financial_filtered.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4059 entries, 1 to 2163
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4059 non-null   object
 1   adult                  4059 non-null   float64
 2   backdrop_path          3259 non-null   object
 3   belongs_to_collection  612 non-null    object
 4   budget                 4059 non-null   float64
 5   genres                 4059 non-null   object
 6   homepage               1073 non-null   object
 7   id                     4059 non-null   float64
 8   original_language      4059 non-null   object
 9   original_title         4059 non-null   object
 10  overview               4038 non-null   object
 11  popularity             4059 non-null   float64
 12  poster_path            3869 non-null   object
 13  production_companies   4059 non-null   object
 14  production_countries   4059 non-null   object
 15  release_date           4041 non-null   object
 16  revenue                4059 non-null   float64
 17  runtime                4059 non-null   float64
 18  spoken_languages       4059 non-null   object
 19  status                 4059 non-null   object
 20  tagline                2932 non-null   object
 21  title                  4059 non-null   object
 22  video                  4059 non-null   float64
 23  vote_average           4059 non-null   float64
 24  vote_count             4059 non-null   float64
 25  certification          2594 non-null   object
dtypes: float64(9), object(17)
memory usage: 856.2+ KB

- How many movies are there in each of the certification categories?

In [52]:
# counter per categories
with_financial_filtered['certification'].value_counts()

R        1220
PG-13     794
PG        285
NR        219
G          65
NC-17      11
Name: certification, dtype: int64

- What is the average revenue per certification catergory?

In [53]:
# get avg rev per certification
for cert in with_financial_filtered['certification'].unique():
    certification_filtered = with_financial_filtered[with_financial_filtered['certification']== cert]
    avg_rev = certification_filtered['revenue'].mean()
    print(f"Ave revenue for {cert} is ${avg_rev}")

Ave revenue for nan is $nan
Ave revenue for PG is $102182855.43508773
Ave revenue for R is $28812161.040163934
Ave revenue for G is $111284151.84615384
Ave revenue for PG-13 is $93770848.05415617
Ave revenue for NR is $11615873.730593607
Ave revenue for NC-17 is $11389578.272727273

- What is the ave budget per cetification?

In [54]:
# get avg rev per certification
for cert in with_financial_filtered['certification'].unique():
    certification_filtered = with_financial_filtered[with_financial_filtered['certification']== cert]
    avg_rev = certification_filtered['budget'].mean()
    print(f"Ave budget for {cert} is ${avg_rev}")

Ave budget for nan is $nan
Ave budget for PG is $38126047.8631579
Ave budget for R is $15900591.68852459
Ave budget for G is $41642733.92307692
Ave budget for PG-13 is $37309447.41813602
Ave budget for NR is $4004608.1506849313
Ave budget for NC-17 is $5492454.545454546

In [55]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14351 entries, 0 to 2167
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                14351 non-null  object
 1   adult                  14342 non-null  float64
 2   backdrop_path          7904 non-null   object
 3   belongs_to_collection  1122 non-null   object
 4   budget                 14342 non-null  float64
 5   genres                 14342 non-null  object
 6   homepage               2073 non-null   object
 7   id                     14342 non-null  float64
 8   original_language      14342 non-null  object
 9   original_title         14342 non-null  object
 10  overview               14006 non-null  object
 11  popularity             14342 non-null  float64
 12  poster_path            12662 non-null  object
 13  production_companies   14342 non-null  object
 14  production_countries   14342 non-null  object
 15  release_date           14107 non-null  object
 16  revenue                14342 non-null  float64
 17  runtime                14342 non-null  float64
 18  spoken_languages       14342 non-null  object
 19  status                 14342 non-null  object
 20  tagline                6140 non-null   object
 21  title                  14342 non-null  object
 22  video                  14342 non-null  float64
 23  vote_average           14342 non-null  float64
 24  vote_count             14342 non-null  float64
 25  certification          4608 non-null   object
dtypes: float64(9), object(17)
memory usage: 3.0+ MB

In [56]:
# Convert df back to csv
combined_df.to_csv(f"tmdb_results_combined.csv.gz", compression='gzip',
                     index=False)

### Normalize Tables

In [57]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81775 entries, 0 to 81774
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81775 non-null  object
 1   titleType       81775 non-null  object
 2   primaryTitle    81775 non-null  object
 3   originalTitle   81775 non-null  object
 4   isAdult         81775 non-null  int64
 5   startYear       81775 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81775 non-null  int64
 8   genres          81775 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.6+ MB

- We will only need Movie ID(tconst), Primary Title, Start Year, Runtime (in Minutes) and Genres from Title Basics table so we can drop the rest

In [58]:
# Drop Unnecessary columns
basics_df.drop(columns=["titleType","isAdult","endYear","originalTitle"], inplace=True)

In [59]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81775 entries, 0 to 81774
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81775 non-null  object
 1   primaryTitle    81775 non-null  object
 2   startYear       81775 non-null  int64
 3   runtimeMinutes  81775 non-null  int64
 4   genres          81775 non-null  object
dtypes: int64(2), object(3)
memory usage: 3.1+ MB

In [60]:
basics_df.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013,120,"Drama,History"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
3,tt0069049,The Other Side of the Wind,2018,122,Drama
4,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"

In [61]:
# Split genre str 
basics_df['genres_split'] = basics_df['genres'].str.split(',')

In [62]:
# Separate genres using explode
exploded_genres = basics_df.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,Life of a Beijing Policeman,2013,120,"Drama,History",Drama
1,tt0043139,Life of a Beijing Policeman,2013,120,"Drama,History",History
...,...,...,...,...,...,...
81773,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Action
81773,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Adventure
81773,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Thriller
81774,tt9916362,Coven,2020,92,"Drama,History",Drama
81774,tt9916362,Coven,2020,92,"Drama,History",History

In [63]:
# Create genre IDs for each unique genre 
unique_genre = sorted(exploded_genres['genres_split'].unique())
unique_genre[:3]

['Action', 'Adult', 'Adventure']

In [64]:
# Set Int value for each unique ID 
genre_ID = range(len(unique_genre))
genre_ID

range(0, 25)

In [65]:
# Create mapper 
id_map = dict(zip(unique_genre,genre_ID))
id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [66]:
# Create new table called title_genres
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

In [67]:
# Replace genres column with genre_id
title_genres['genre_id'] = title_genres['genres_split'].replace(id_map)
title_genres.drop(columns='genres_split',inplace=True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

In [68]:
# Create genres table with genre
genres= pd.DataFrame({'genre_name':id_map.keys(),
                      'genre_id': id_map.values()})

genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [69]:
# Rename basics_df to title_basics
title_basics = basics_df
title_basics.drop(columns=["genres","genres_split"],inplace=True)
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0043139,Life of a Beijing Policeman,2013,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0088751,The Naked Monster,2005,100

In [70]:
# Rename us_ratings_df to title_ratings
title_ratings = us_ratings_df
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1981
1  tt0000002            5.8       264
4  tt0000005            6.2      2622
5  tt0000006            5.1       182
6  tt0000007            5.4       820

- We only need Movie ID, Revenue, Budget, Certification(MPAA Rating) from our API results so we can drop the rest.

In [71]:
# Drop unnecessary columns
cols = ["imdb_id", "revenue","budget",'certification']
API_Results = combined_df[cols]
API_Results.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14351 entries, 0 to 2167
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        14351 non-null  object
 1   revenue        14342 non-null  float64
 2   budget         14342 non-null  float64
 3   certification  4608 non-null   object
dtypes: float64(2), object(2)
memory usage: 560.6+ KB

In [72]:
# Rename API_results to tmdb_data
tmdb_data = API_Results
tmdb_data.drop(index=0,inplace=True)

tmdb_data.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG
5  tt0118852         0.0         0.0             R

## Creating MySQL Database

### Imports

In [73]:
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

### Credentials

In [74]:
with open("/Users/kim/.secret/mysql_credentials.json", "r") as f:
    login = json.load(f)

# Display loaded dict 
login.keys()

dict_keys(['user', 'password'])

In [75]:
# Assign credentials
username = login['user']
password = login['password']

In [76]:
# Set Connection and Engine
connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/movies"
engine = create_engine(connection)

In [77]:
# Check if database exists
if database_exists(connection):
    print("It exist")
else:
    create_database(connection)
    print('Database created')

It exist

In [78]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81775 entries, 0 to 81774
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81775 non-null  object
 1   primaryTitle    81775 non-null  object
 2   startYear       81775 non-null  int64
 3   runtimeMinutes  81775 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.5+ MB

In [79]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':INT(),
    'runtimeMinutes':Integer()}

In [80]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81775

In [81]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [82]:
query = '''SELECT *
            FROM title_basics
            LIMIT 5;'''
pd.read_sql(query,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0043139,Life of a Beijing Policeman,2013,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0088751,The Naked Monster,2005,100

In [83]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 501745 entries, 0 to 1322494
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         501745 non-null  object
 1   averageRating  501745 non-null  float64
 2   numVotes       501745 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.3+ MB

In [84]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(key_len+1), 
    "averageRating":Float(),
    "numVotes":INT()}

In [85]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

501745

In [86]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [87]:
query = '''SELECT *
            FROM title_ratings
            LIMIT 5;'''
pd.read_sql(query,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1981
1  tt0000002            5.8       264
2  tt0000005            6.2      2622
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [88]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14342 entries, 1 to 2167
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        14342 non-null  object
 1   revenue        14342 non-null  float64
 2   budget         14342 non-null  float64
 3   certification  4608 non-null   object
dtypes: float64(2), object(2)
memory usage: 560.2+ KB

In [89]:
tmdb_data.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [90]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(key_len+1), 
    "revenue":Float(),
    "budget":Float(),
    "certification":String(cert_len+1)}

In [91]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',index=False)

14342

In [92]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [93]:
query = '''SELECT *
            FROM tmdb_data
            LIMIT 5;'''
pd.read_sql(query,engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0088751         0.0    350000.0          None
2  tt0096056         0.0         0.0          None
3  tt0103340         0.0         0.0          None
4  tt0113026         0.0  10000000.0          None

In [94]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [95]:
## Calculate max string lengths for object columns
genre_len = genres['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genre_schema = {
    "genre_name": String(key_len+1), 
    "genre_id":INT()}

In [96]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=genre_schema,if_exists='replace',index=False)

25

In [97]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [98]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153249 entries, 0 to 81774
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153249 non-null  object
 1   genre_id  153249 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [99]:
## Calculate max string lengths for object columns
tconst_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genre_schema = {
    "tconst": String(tconst_len+1), 
    "genre_id":INT()}

In [100]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genre_schema,if_exists='replace',index=False)

153249

In [101]:
engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`,genre_id);')

In [102]:
query = '''SHOW TABLES'''
pd.read_sql(query,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data